---
kind: method
id: M:Autodesk.Revit.UI.Macros.ApplicationEntryPoint.Initialize(System.Object,System.String)
source: html/bc060e44-2e6c-1e29-4f64-ceb8a020d6ad.htm
---
# Autodesk.Revit.UI.Macros.ApplicationEntryPoint.Initialize Method

For Revit Macros internal use only.

## Syntax (C#)
```csharp
public void Initialize(
	Object obj,
	string addinFolder
)
```

## Parameters
- **obj** (`System.Object`)
- **addinFolder** (`System.String`)